tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

tap 'heroku/brew'
tap 'goles/battery'
tap 'uptech/homebrew-oss'

# The commented out ones were installed manually (brew doesn't like that)
cask '1password'
cask '1password-cli'
cask 'arduino'
cask 'arc'
cask 'asana'
cask 'brave-browser'
cask 'cleanshot' # Screen Capture app
cask 'devtoys'
cask 'discord'
cask 'dropbox'
cask 'fantastical'
cask 'finicky' # Browser chooser app
cask 'github'
cask 'google-chrome'
cask 'hiddenbar'
cask 'iTerm2'
cask 'maccy'
cask 'obsidian'
# cask 'pomodone'
cask 'private-internet-access'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'vlc'
cask 'warp'

# Fonts
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-iosevka"
# cask "font-monoid"
cask "font-monoisome"

brew 'uptech/oss/alt' # For finding alt files
brew 'arduino-cli'
brew 'battery'
brew 'diff-so-fancy'
brew 'fswatch'
brew 'fzf'
brew 'gcc'
brew 'gh'
brew 'git'
brew 'git-town'
brew 'heroku'
brew 'neovim'
brew 'nginx'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'ruby'
# brew 'sbt'
# brew 'scala'
# brew 'spark'
# brew 'sphinx-doc'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tmux'
brew 'yamllint'
brew 'yarn'
brew 'zsh'
# brew 'zsh-completions' # needs to be installed manually to on-my-zsh
# brew 'zsh-syntax-highlighting' # needs to be installed manually to on-my-zsh

