tap 'goles/battery'

brew 'alt'
brew 'battery'
brew 'fswatch'
brew 'fzf'
brew 'gcc'
brew 'git'
brew 'neovim'
brew 'nginx'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'python'
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'ruby'
brew 'sbt'
brew 'scala'
brew 'scalafmt'
brew 'spark'
brew 'sphinx-doc'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tmux'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'
